# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database ERD

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="https://curriculum-content.s3.amazonaws.com/data-science/images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database `data.sqlite`.

In [1]:
# Your code here; import the necessary packages
import sqlite3
import pandas as pd

In [2]:
# Your code here; create the connection
conn = sqlite3.connect('data.sqlite')

## Write an Equivalent Query using a Subquery

The following query works using a `JOIN`. Rewrite it so that it uses a subquery instead.

```
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
```

In [ ]:
select customerNumber, contactLastName, contactFirstName
from customers
where customerNumber in (
    select customerNumber from orders where orderDate = '2003-01-31'
)

In [4]:
# Your code here
df = pd.read_sql("""
select customerNumber, contactLastName, contactFirstName
from customers
where customerNumber in (
    select customerNumber from orders where orderDate = '2003-01-31'
)
""", conn)
df

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [ ]:
select productName, sumOrders
from (
    select productName, productCode, count(*) as sumOrders
    from products join orderdetails using(productCode)
    group by productCode
)

In [6]:
# Your code here
df = pd.read_sql("""
select productName, sumOrders
from (
    select productName, productCode, count(*) as sumOrders
    from products join orderdetails using(productCode)
    group by productCode
)
""", conn)
df

                               productName  sumOrders
0    1969 Harley Davidson Ultimate Chopper         28
1                 1952 Alpine Renault 1300         28
2                    1996 Moto Guzzi 1100i         28
3     2003 Harley-Davidson Eagle Drag Bike         28
4                      1972 Alfa Romeo GTA         28
..                                     ...        ...
104                            The Titanic         27
105                         The Queen Mary         27
106              American Airlines: MD-11S         28
107                       Boeing X-32A JSF         28
108                             Pont Yacht         27

[109 rows x 2 columns]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [8]:
select productName, peopleSum
from (
    select productName, count(distinct customerNumber) as peopleSum
    from ((products join orderdetails using(productCode)) join orders using(orderNumber))
    group by productName
)

SyntaxError: invalid syntax (676526354.py, line 1)

In [11]:
# Your code here
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT
df = pd.read_sql("""
select productName, peopleSum
from (
    select productName, count(distinct customerNumber) as peopleSum
    from ((products join orderdetails using(productCode)) join orders using(orderNumber))
    group by productName
    order by peopleSum desc
)
""", conn)
df

                             productName  peopleSum
0            1992 Ferrari 360 Spider red         40
1                       Boeing X-32A JSF         27
2                    1972 Alfa Romeo GTA         27
3               1952 Alpine Renault 1300         27
4                     1934 Ford V8 Coupe         27
..                                   ...        ...
104  1958 Chevy Corvette Limited Edition         19
105                  2002 Chevy Corvette         18
106            1969 Chevrolet Camaro Z28         18
107                    1952 Citroen-15CV         18
108                   1949 Jaguar XK 120         18

[109 rows x 2 columns]

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products That Have Been Ordered by Fewer Than 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
# Your code here

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit Over 15K

In [ ]:
# Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!